{"/about/":{"data":{"":"I am a PhD student studying Controls and Dynamical Systems at Caltech in the Amber Lab; before that I was an undergraduate student in Computer Engineering at Georgia Tech.\nMy main interests are in controls and legged robotics. I strive to contribute to robotics through both theoretical findings and engineering efforts. I want to make robots that improve the world, so I always make sure my work has real world applications.\nEver since 4th grade, when I built my first Lego robots, I have been interested in robotics. In high school I competed in FRC, and at Georgia Tech I continued my robotics education through classes and my work at the AREAL Lab. In the AREAL lab I worked on autonomous flight systems such as quadcopters. Beyond my academic experience, I have worked in industry at Left Hand Robotics (now a part of Toro) where we designed autonomous snow clearing and lawn mowing robots.","additional-info#Additional Info":"Linkedin\nGoogle Scholar\nGithub"},"title":"About"},"/blog/icm_20948_driver/":{"data":{"":"","a-device-agnostic-driver-for-the-icm-20948-imu-written-in-rust#A device agnostic driver for the ICM-20948 IMU written in Rust":" This project is a ICM-20948 (Inertial Measurement Unit) device driver written in Rust. The driver uses the embedded-hal traits and thus can be used on any microcontroller that has a HAL that implements those traits. The source code can be found on github. Documentation can be found on the docs.rs page. The data sheet for this device can be found here. See the documentation for current limitations and future plans. Please create an issue on github or contact me if there are issues that need to be resolved.\nI decided to start writing this driver to practice writing Rust and to provide an easy to use IMU driver for future projects. I hope to use it in my robotics projects.\nI currently have plans to update the driver soon with changes as suggested in the Github Repo. Another blog post will be published when those changes go live.","relevant-links#Relevant Links":"Github\nDocs.rs\nCrates.io\nIMU Datasheet"},"title":"icm20948_driver"},"/blog/new_website/":{"data":{"":"","welcome#Welcome!":" I have recently update my website to have a more modern and sleek feel. Furthermore, it should be easier for me to update it so the information is accurate at all times.\nI hope to keep this blog updated as I have time. In general, I plan to anounce new software tools and open source projects here. I also expect to post additional musing or things that I find useful or interesting.\nThe research tab above will hold (relatively) up to date information about my research projects inculding brief overviews and links to relavent code and papers."},"title":"New Website"},"/research/":{"data":{"":" Locomotion on Constrained Footholds via Layered Architectures and Model Predictive ControlCaltech, 2025 Layered Nonlinear Model Predictive Control for Robust Stabilization of Hybrid SystemsCaltech, 2024 Bilevel Optimization for Real-Time Control with Application to Locomotion Gait GenerationCaltech, 2024 Custom First Responder DroneGeorgia Tech, 2022 Autonomous Quadrotor Trajectory Planning and Control for In-Flight Aerial Vehicle CaptureGeorgia Tech, 2021 Drone Dock Cruise ControlGeorgia Tech, 2021 Indoor Flight Lab Synthetic GPSGeorgia Tech, 2021 "},"title":"Research"},"/research/aerial_capture/":{"data":{"":"","abstract#Abstract":"This paper develops a path planning and control architecture for an interceptor air vehicle designed to capture small target UAVs, which are assumed to be at rest or moving slowly. The proposed architecture has three main parts. First, a geometric path planner is developed to determine the trajectory for the quadrotor to travel from its initial location to the rendezvous location. The second component of the architecture is a minimal-time thrust profile generation algorithm. The algorithm represents the quadrotor’s acceleration as a B-Spline and uses the convex-hull property of the spline to transform the constraints into functions of the control points so an optimization problem can be formulated to minimize time to capture. Lastly, a low-level controller tracks the orientation and thrust commands. In this architecture, the thrust profile and geometric path are generated independently. The proposed planning and control architecture provide one key advantage over alternative optimal control approaches: by separating the thrust profile generation from the geometric path generation, the minimal time trajectory generation problem has fewer variables and constraints to calculate, thus allowing on-board calculation of the thrust profile. Results are presented demonstrating aerial capture of targets in simulation.\nGenerated trajectory. The vehichle to capture is the ellipsoid in the center, and the controlled vehicle starts on the ground below it. ","additional-info#Additional Info":"Authors: Zachary Olkin, Jonathan Rogers\nLocation: AREAL, Georgia Tech\nDate: May, 2020 - January 2021\nPaper\nGithub"},"title":"Autonomous Quadrotor Trajectory Planning and Control for In-Flight Aerial Vehicle Capture"},"/research/bilevel-gait-gen/":{"data":{"":"","abstract#Abstract":"Model Predictive Control (MPC) is a common tool for the control of nonlinear, real-world systems, such as legged robots. However, solving MPC quickly enough to enable its use in real-time is often challenging. One common solution is given by real-time iterations, which does not solve the MPC problem to convergence, but rather close enough to give an approximate solution. In this paper, we extend this idea to a bilevel control framework where a “high-level” optimization program modifies a controller parameter of a “low-level” MPC problem which generates the control inputs and desired state trajectory. We propose an algorithm to iterate on this bilevel program in real-time and provide conditions for its convergence and improvements in stability. We then demonstrate the efficacy of this algorithm by applying it to a quadrupedal robot where the high-level problem optimizes a contact schedule in real-time. We show through simulation that the algorithm can yield improvements in disturbance rejection and optimality, while creating qualitatively new gaits.\nStructure of the bilevel optimization. The MPC uses parameters from the high-level optimization and outputs the control inputs and state trajectory. When applied to the quadruped, the high-level parameter is the contact schedule. The green dots indicate contact with the ground and show how the contact schedule changes over time. ","additional-info#Additional Info":"Authors: Zachary Olkin, Aaron Ames\nConference: CDC 2024 (Conference on Decision and Control)\nLocation of work: Amber Lab, Caltech\nDates of work: October 2023 - April 2024\nPaper: arXiv\nGithub"},"title":"Bilevel Optimization for Real-Time Control with Application to Locomotion Gait Generation"},"/research/clf_rl/":{"data":{"":"","abstract#Abstract":"Reinforcement learning (RL) has shown promise in generating robust locomotion policies for bipedal robots, but often suffers from tedious reward design and sensitivity to poorly shaped objectives. In this work, we propose a structured reward shaping framework that leverages model-based trajectory generation and control Lyapunov functions (CLFs) to guide policy learning. We explore two model-based planners for generating reference trajectories: a reduced-order linear inverted pendulum (LIP) model for velocity-conditioned motion planning, and a precomputed gait library based on hybrid zero dynamics (HZD) using full-order dynamics. These planners define desired end-effector and joint trajectories, which are used to construct CLF-based rewards that penalize tracking error and encourage rapid convergence. This formulation provides meaningful intermediate rewards, and is straightforward to implement once a reference is available. Both the reference trajectories and CLF shaping are used only during training, resulting in a lightweight policy at deployment. We validate our method both in simulation and through extensive real-world experiments on a Unitree G1 robot. CLF-RL demonstrates significantly improved robustness relative to the baseline RL policy and better performance than a classic tracking reward RL formulation.","additional-info#Additional Info":"Authors: Kejun Li*, Zachary Olkin*, Yisong Yue, Aaron Ames (* indicates equal contribution).\nJournal: Submitted to RA-L\nLocation of work: Amber Lab, Caltech\nDates of work: June 2025 - August 2025\nPaper: arxiv\nRL + Deployment Code, Trajopt Code. The first repo hosts all the RL code and the code to deploy on the hardware. The second repo has the code for generating the trajectories.","pictures#Pictures":" Demonstration of the layered controller dynamically navigating over complex terrain and locomoting effectively on flat ground. The controller is both versatile in the terrain and actions it can stabilize and fast enough for real-time control. ","video#Video":" "},"title":"CLF-RL: Control Lyapunov Function Guided Reinforcement Learning"},"/research/drone_dock/":{"data":{"":"","additional-info#Additional Info":"Location: AREAL Lab, Georgia Tech\nDates: January 2021 - March 2021","description#Description":"I modified a R/C car to have a cruise control system and log critical data. The overall goal of the research project is to land an autonomous quadcopter on a moving dock. The truck pictured below will have the landing dock mounted ontop. This cruise control system has a few modes: a “pass through” mode where the truck can be controlled normally, a mode in which the cruise control setpoint can be wirelessly changed, and a cruise control mode where a constant PWM width is passed into the ESC from the onboard computer. GPS data is logged onto a micro SD card for further analysis after the test runs. By using this system, the truck does not need to be driven during testing, and a constant velocity can be used for testing. This makes it easier to debug and run tests with the system.\nFinished drone dock showcasing electronics. "},"title":"Drone Dock Cruise Control"},"/research/first_responders_drone/":{"data":{"":"","additional-info#Additional Info":"Location: AREAL, Georgia Tech\nDate: January 2021 - May 2022","description#Description":"I was creating a custom built drone that is optimized for use by first responders. The goal was to build a drone that can take off after an upside down landing, stabilize its position indoors without GPS, and function in complete darkness all while gathering critical information for first responders. I generated requirements, wrote specifications, wrote code, designed and soldered electronics, and modeled, fabriacted, and built a custom drone. This was a solo project where I performed all of the design, implementation, and testing of the quadcopter. This project has been an amazing learning experience where I have improved my engineering skills and learned to make solutions that are robust and accurate.\nVersion 1 of the first responder drone. "},"title":"Custom Drone for First Responders"},"/research/ifl_gps/":{"data":{"":"","additional-info#Additional Info":"Location: AREAL and Indoor Flight Lab (IFL), Georgia Tech\nDates: January 2020 - January 2021","description#Description":"Description I designed and tested a tool that takes in VICON motion caputre data and converts it to an equivalent stream of data formatted as a GPS. Using this tool, any flight controller that would expect GPS data can be used in the Indoor Flight Lab (IFL) at Georgia Tech with no modifications. The tool can be easily customized to fit anyone’s needs. Additional noise can be artifically added to the VICON data to better emulate GPS data. The rate at which the data is output and the format of the data (NMEA and UBX) can also be chosen.\nSynthetic GPS device connected to a flight controller in the IFL. "},"title":"Indoor Flight Lab Synthetic GPS"},"/research/layered_mpc_control_through_contact/":{"data":{"":" ","abstract#Abstract":"Computing stabilizing and optimal control actions for legged locomotion in real time is difficult due to the nonlinear, hybrid, and high dimensional nature of these robots. The hybrid nature of the system introduces a combination of discrete and continuous variables which causes issues for numerical optimal control. To address these challenges, we propose a layered architecture that separates the choice of discrete variables and a smooth Model Predictive Controller (MPC). The layered formulation allows for online flexibility and optimality without sacrificing real-time performance through a combination of gradient-free and gradient-based methods. The architecture leverages a sampling-based method for determining discrete variables, and a classical smooth MPC formulation using these fixed discrete variables. We demonstrate the results on a quadrupedal robot stepping over gaps and onto terrain with varying heights. In simulation, we demonstrate the controller on a humanoid robot for gap traversal. The layered approach is shown to be more optimal and reliable than common heuristic-based approaches and faster to compute than pure sampling methods.","additional-info#Additional Info":"Authors: Zachary Olkin, Aaron Ames\nConference: Humanoids 2025\nLocation of work: Amber Lab, Caltech\nDates of work: September 2024 - April 2025\nPaper: arxiv\nGithub repo 1, Github repo 2. The second repo (TORC) has the MPC code as a library and the first repo is the code that actually runs the simulation and hardware.","pictures#Pictures":" Demonstration of the layered controller dynamically navigating over complex terrain and locomoting effectively on flat ground. The controller is both versatile in the terrain and actions it can stabilize and fast enough for real-time control. ","video#Video":" "},"title":"Locomotion on Constrained Footholds via Layered Architectures and Model Predictive Control"},"/research/layered_mpc_hybrid_robustness/":{"data":{"":"","abstract#Abstract":"Computing the receding horizon optimal control of nonlinear hybrid systems is typically prohibitively slow, limiting real-time implementation. To address this challenge, we propose a layered Model Predictive Control (MPC) architecture for robust stabilization of hybrid systems. A high level “hybrid” MPC is solved at a slow rate to produce a stabilizing hybrid trajectory, potentially sub-optimally, including a domain and guard sequence. This domain and guard sequence is passed to a low level “fixed mode” MPC which is a traditional, time-varying, state-constrained MPC that can be solved rapidly, e.g., using nonlinear programming (NLP) tools. A robust version of the fixed mode MPC is constructed by using tracking error tubes that are not guaranteed to have finite size for all time. Using these tubes, we demonstrate that the speed at which the fixed mode MPC is re-calculated is directly tied to the robustness of the system, thereby justifying the layered approach. Finally, simulation examples of a five link bipedal robot and a controlled nonlinear bouncing ball are used to illustrate the formal results.\nThe hybrid MPC layer determines a feasible path at a slow rate, and passes these modes to the fixed mode MPC. This MPC computes a robustly stabilizing solution at a higher rate. The trajectory and feed forward input is passed to the low level controller where it is tracked. We use properties of the low level controller to determine the size of the tube. The resulting control action is applied to the dynamics. ","additional-info#Additional Info":"Authors: Zachary Olkin, Aaron Ames\nConference: ACC 2025 (American Control Conference)\nLocation of work: Amber Lab, Caltech\nDates of work: May 2024 - September 2024\nPaper: arxiv\nGithub. Note that the code was not designed as a library. This is just the code to re-create the examples."},"title":"Layered Nonlinear Model Predictive Control for Robust Stabilization of Hybrid Systems"}}